In [2]:
from datetime import datetime
from datetime import timedelta

datetime.today()

datetime.datetime(2022, 3, 7, 11, 3, 30, 657874)

In [3]:
today = datetime.today().strftime('%Y- dwd %m - dwd %d')
today

'2022- dwd 03 - dwd 07'

In [4]:
type(today)

str

In [5]:
todaytime = datetime.today().strftime('%Y-%m-%d %H:%M:%S')
todaytime

'2022-03-07 11:04:45'

In [6]:
type(todaytime)

str

In [9]:
todaytime = todaytime.split(" ")[0]

In [10]:
todaytime

'2022-03-07'

In [7]:
datetime.today()

datetime.datetime(2022, 3, 7, 11, 4, 54, 320394)

In [11]:
datetime.strptime(todaytime, '%Y-%m-%d')

datetime.datetime(2022, 3, 7, 0, 0)

In [12]:
todaytime

'2022-03-07'

In [13]:
time = datetime.today()
time

datetime.datetime(2022, 3, 7, 11, 7, 1, 904186)

In [14]:
time.strftime('%Y')

'2022'

In [15]:
time.year

2022

In [16]:
type(time.year)

int

In [17]:
time.strftime('%m')

'03'

In [18]:
time.month

3

In [19]:
time.strftime('%d')

'07'

In [20]:
time.day

7

In [21]:
time.strftime('%H')

'11'

In [22]:
time.hour

11

In [23]:
time.strftime('%A')

'Monday'

In [24]:
time.weekday()

0

In [25]:
timedelta(days = 100)

datetime.timedelta(days=100)

In [26]:
time = datetime.today()

In [27]:
time

datetime.datetime(2022, 3, 7, 11, 8, 45, 239007)

In [28]:
time + timedelta(days = 100)

datetime.datetime(2022, 6, 15, 11, 8, 45, 239007)

In [29]:
time - timedelta(days = 100)

datetime.datetime(2021, 11, 27, 11, 8, 45, 239007)

In [30]:
(time - timedelta(days = 100)).strftime('%Y-%m-%d %H:%M:%S')

'2021-11-27 11:08:45'

In [31]:
import pandas as pd

df = pd.read_csv('../data/구매내역.csv')

In [34]:
df_pur = df

In [36]:
df_pur.head()

   datetime  purchase
0  20140627     30000
1  20140711     15000
2  20140707     20000
3  20140711     25000
4  20150120     30000

In [35]:
df_pur.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  14 non-null     int64
 1   purchase  14 non-null     int64
dtypes: int64(2)
memory usage: 352.0 bytes

In [37]:
df_pur['datetime'] = df_pur['datetime'].astype(str)

In [38]:
df_pur.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  14 non-null     object
 1   purchase  14 non-null     int64
dtypes: int64(1), object(1)
memory usage: 352.0+ bytes

In [43]:
df_pur['datetime'] = pd.to_datetime(df_pur['datetime'], format = '%Y%m%d')
df_pur.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  14 non-null     datetime64[ns]
 1   purchase  14 non-null     int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 352.0 bytes

In [44]:
df_pur.head()

    datetime  purchase
0 2014-06-27     30000
1 2014-07-11     15000
2 2014-07-07     20000
3 2014-07-11     25000
4 2015-01-20     30000

In [45]:
df_pur.datetime.dt.month

0     6
1     7
2     7
3     7
4     1
5     7
6     7
7     6
8     5
9     7
10    7
11    7
12    7
13    7
Name: datetime, dtype: int64

In [46]:
df_pur[df_pur.datetime.dt.month.isin([6,7,8])]

     datetime  purchase
0  2014-06-27     30000
1  2014-07-11     15000
2  2014-07-07     20000
3  2014-07-11     25000
5  2014-07-07     60000
6  2014-07-08    150000
7  2016-06-23     20000
9  2014-07-10     26800
10 2014-07-04      1800
11 2014-07-08     18600
12 2014-07-09     15000
13 2014-07-10     26050

In [47]:
df_pur.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  14 non-null     datetime64[ns]
 1   purchase  14 non-null     int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 352.0 bytes

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  14 non-null     datetime64[ns]
 1   purchase  14 non-null     int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 352.0 bytes

In [49]:
df.head()

    datetime  purchase
0 2014-06-27     30000
1 2014-07-11     15000
2 2014-07-07     20000
3 2014-07-11     25000
4 2015-01-20     30000

In [52]:
df['datetime'].dt.strftime('%Y/%m/%d')

0     2014/06/27
1     2014/07/11
2     2014/07/07
3     2014/07/11
4     2015/01/20
5     2014/07/07
6     2014/07/08
7     2016/06/23
8     2017/05/15
9     2014/07/10
10    2014/07/04
11    2014/07/08
12    2014/07/09
13    2014/07/10
Name: datetime, dtype: object

In [53]:
df['datetime'].dt.strftime('%m')

0     06
1     07
2     07
3     07
4     01
5     07
6     07
7     06
8     05
9     07
10    07
11    07
12    07
13    07
Name: datetime, dtype: object

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  14 non-null     datetime64[ns]
 1   purchase  14 non-null     int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 352.0 bytes

In [55]:
df['datetime'] = df['datetime'].map(lambda x : x.strftime('%Y.%m.%d'))

In [56]:
df['datetime']

0     2014.06.27
1     2014.07.11
2     2014.07.07
3     2014.07.11
4     2015.01.20
5     2014.07.07
6     2014.07.08
7     2016.06.23
8     2017.05.15
9     2014.07.10
10    2014.07.04
11    2014.07.08
12    2014.07.09
13    2014.07.10
Name: datetime, dtype: object

In [57]:
df

      datetime  purchase
0   2014.06.27     30000
1   2014.07.11     15000
2   2014.07.07     20000
3   2014.07.11     25000
4   2015.01.20     30000
5   2014.07.07     60000
6   2014.07.08    150000
7   2016.06.23     20000
8   2017.05.15    265000
9   2014.07.10     26800
10  2014.07.04      1800
11  2014.07.08     18600
12  2014.07.09     15000
13  2014.07.10     26050